Repository: dev-schwarz/flutter_cinemascope
Catalog: cinemascope/assets/i18n/intl_*.arb
Languages: pt

# yes
source: {firstLetterUCase,select, true{Yes}false{yes}}
pt: {firstLetterUCase,select, true{Sim}false{sim}}

# no
source: {firstLetterUCase,select, true{No}false{no}}
pt: {firstLetterUCase,select, true{Não}false{não}}

# yesNo
source: {yes,select, true{yes}false{no}}
pt: {yes,select, true{sim}false{não}}

source: Trending
pt: Em Destaque

source: Discover
pt: Descubra

source: Assignments
pt: Inscrições

source: Library
pt: Biblioteca

source: Settings
pt: Configurações

# settingsLanguages
source: Select a language
pt: Selecione um idioma

# settingsRegions
source: Select a region
pt: Selecione uma região

source: Favorite
pt: Favoritos

# favoriteTooltip
source: {value,select, true{Remove from favorites}false{Add to favorites}}
pt: {value,select, true{Remover dos favoritos}false{Adicionar aos favoritos}}

source: Watch List
pt: Assistir depois

# watchListTooltip
source: {value,select, true{Remove from watch list}false{Add to watch list}}
pt: {value,select, true{Remover da lista para assistir}false{Adicionar a lista para assistir}}

source: Rate
pt: Avaliar

# rateTooltip
source: {value,select, true{Edit or remove your rating}false{Rate}}
pt: {value,select, true{Editar ou remover sua avaliação}false{Avaliar}}

# playlist
source: Add to playlist
pt: Minhas listas

# playlistTooltip
source: Add to playlist
pt: Adicionar ou remover das minhas listas

# mediaFavoriteChanged
source: {value,select, true{Added to favorites}false{Removed from favorites}}
pt: {value,select, true{Adicionado aos favoritos}false{Removido dos favoritos}}

# mediaWatchListChanged
source: {value,select, true{Added to watch list}false{Removed from watch list}}
pt: {value,select, true{Adicionado a lista para assistir}false{Removido da lista para assistir}}

# mediaRateChanged
source: {value,select, true{Item rated}false{Item rating cleared}}
pt: {value,select, true{Item avaliado}false{Avaliação do item removida}}

# _mediaListsChanged
source: {added,select, true{{howMany,plural, =0{}=1{Added to 1 list. }other{Added to {howMany} lists. }}}false{{howMany,plural, =0{}=1{Removed from 1 list. }other{Removed from {howMany} lists. }}}}
pt: {added,select, true{{howMany,plural, =0{}=1{Adicionado a 1 lista. }other{Adicionado a {howMany} listas. }}}false{{howMany,plural, =0{}=1{Removido de 1 lista. }other{Removido de {howMany} listas. }}}}

# sortOrder
source: {order,select, asc{{invert,select, true{descending}false{ascending}}}desc{{invert,select, true{ascending}false{descending}}}}
pt: {order,select, asc{{invert,select, true{descendente}false{ascendente}}}desc{{invert,select, true{ascendente}false{descendente}}}}

# _sortOrderSwitch
source: Switch to "{orderText}" order
pt: Mudar para ordem "{orderText}"

# pageTitle
source: Discover Movies
pt: Descobrir Filmes

# setupTitle
source: Discover Movies Setup
pt: Descobrir Filmes - Filtros

# setupButton
source: Setup Filters
pt: Configurar Filtros

# closeButton
source: Close
pt: Fechar

# applyButton
source: Apply
pt: Aplicar

# _sortText
source: {sortText,select, popularity{Popularity}original_title{Original title}release_date{Release date}vote_average{Vote average}vote_count{Vote count}revenue{Revenue}}
pt: {sortText,select, popularity{Popularidade}original_title{Título}release_date{Lançamento}vote_average{Avaliação}vote_count{Mais votados}revenue{Renda}}

# orderText
source: {order,select, asc{Ascending order}desc{Descending order}}
pt: {order,select, asc{Ordem ascendente}desc{Ordem descendente}}

source: Year
pt: Ano

source: of release
pt: de lançamento

# yearOfReleaseHint
source: Sample: 2004
pt: Exemplo: 2004

# yearOfReleaseError
source: Invalid year
pt: Ano inválido
